In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Split into columns

In [2]:
d1 = {'teams': [['SF', 'GSW'],['SF', 'LAC'],['WIS', 'BAR'],
                ['GSW', 'NYG'],['BAR', 'LEG'],['LAC', 'NYG'],['LEG', 'NYG']]}
df1 = pd.DataFrame(d1)
df1.reset_index(inplace=True)
df1.columns = 'id teams'.split()
print (df1)

   id       teams
0   0   [SF, GSW]
1   1   [SF, LAC]
2   2  [WIS, BAR]
3   3  [GSW, NYG]
4   4  [BAR, LEG]
5   5  [LAC, NYG]
6   6  [LEG, NYG]

In [3]:
df1[['team1','team2']] = pd.DataFrame(df1["teams"].values.tolist(), index= df1.index)
print (df1)

   id       teams team1 team2
0   0   [SF, GSW]    SF   GSW
1   1   [SF, LAC]    SF   LAC
2   2  [WIS, BAR]   WIS   BAR
3   3  [GSW, NYG]   GSW   NYG
4   4  [BAR, LEG]   BAR   LEG
5   5  [LAC, NYG]   LAC   NYG
6   6  [LEG, NYG]   LEG   NYG

In [4]:
df2 = pd.DataFrame(df1['teams'].values.tolist(), columns=['team1','team2'])
print (df2)

  team1 team2
0    SF   GSW
1    SF   LAC
2   WIS   BAR
3   GSW   NYG
4   BAR   LEG
5   LAC   NYG
6   LEG   NYG

### Split into rows

In [5]:
d1 = {'teams': ['SF,GSW','SF,LAC', 'WIS,BAR', 'GSW,NYG', 'BAR,LEG', 'LAC,NYG','LEG,NYG']}
df1 = pd.DataFrame(d1)
df1.reset_index(inplace=True)
df1.columns = 'id teams'.split()
print (df1)

   id    teams
0   0   SF,GSW
1   1   SF,LAC
2   2  WIS,BAR
3   3  GSW,NYG
4   4  BAR,LEG
5   5  LAC,NYG
6   6  LEG,NYG

In [6]:
def splitDataFrameList(df,target_column,separator):
    ''' df = dataframe to split,
    target_column = the column containing the values to split
    separator = the symbol used to perform the split
    returns: a dataframe with each entry for the target column separated, with each element moved into a new row. 
    The values in the other columns are duplicated across the newly divided rows.
    '''
    def splitListToRows(row,row_accumulator,target_column,separator):
        split_row = row[target_column].split(separator)
        for s in split_row:
            new_row = row.to_dict()
            new_row[target_column] = s
            row_accumulator.append(new_row)
    new_rows = []
    df.apply(splitListToRows,axis=1,args = (new_rows,target_column,separator))
    new_df = pd.DataFrame(new_rows)
    return new_df

splitDataFrameList(df1,"teams",",")

    id teams
0    0    SF
1    0   GSW
2    1    SF
3    1   LAC
4    2   WIS
5    2   BAR
6    3   GSW
7    3   NYG
8    4   BAR
9    4   LEG
10   5   LAC
11   5   NYG
12   6   LEG
13   6   NYG

### Pivot table

In [7]:
data = {'year': ['2016', '2016', '2015', '2014', '2013'],
        'country':['uk', 'usa', 'fr','fr','uk'],
        'sales': [10, 21, 20, 10,12],
        'rep': ['john', 'john', 'claire', 'kyle','kyle']
        }

pd.DataFrame(data)

  country     rep  sales  year
0      uk    john     10  2016
1     usa    john     21  2016
2      fr  claire     20  2015
3      fr    kyle     10  2014
4      uk    kyle     12  2013

In [8]:
pd.DataFrame(data).pivot_table(index='country', columns='year', values=['rep','sales'])

        sales
year     2013  2014  2015  2016
country
fr        NaN  10.0  20.0   NaN
uk       12.0   NaN   NaN  10.0
usa       NaN   NaN   NaN  21.0

In [9]:
df = pd.DataFrame(data)
df.set_index(['year','country']).unstack('year')

          rep                     sales
year     2013  2014    2015  2016  2013  2014  2015  2016
country
fr       None  kyle  claire  None   NaN  10.0  20.0   NaN
uk       kyle  None    None  john  12.0   NaN   NaN  10.0
usa      None  None    None  john   NaN   NaN   NaN  21.0